Лекц шалгалт
Овог: Гансүх
Нэр: Энхлэн
Оюутны код: 20B1NUM1884
6.Системийн нэр: Хоол хүргэлтийн систем
Системийн талаар: Хоол хүргэлтийн үйл ажиллагааг автоматжуулах систем
Хүснэгтүүд: Branch, Customer, Deliverycar, DeliveryWorker, FoodInfo, OrderList, Worker
7. RA 10 асуулт
1)Хоолны мэдээллийн хүснэгтээс 20000-аас дээш үнэтэй хоолны мэдээллийг гаргана уу./Selection үйлдэл ашиглах/
2)Хоолны мэдээллийн хүснэгтээс хоолны нэр, порц, үнийн мэдээллийг харуулна уу.
3)Ажилчин, хүргэлтийн ажилчин хүснэгтүүдээс хүмүүсийн нэрсийн жагсаалтыг гаргана уу.
4)Захиалагдаагүй хоолны дугаарыг гаргана уу./FoodName price - Orderlist price/
5)Teriyaki_chicken захиалсан үйлчлүүлэгчийн утасны дугаар, гэрийн хаягийг харуулна уу.
6)Хоолны үнэ нь ажилтны цалингаас бага байх хоолны нэр, үнийн мэдээллийг харуулна уу.
7)Хоол ба захиалгын хүснэгтийг холбоод хоолны нэр, захиалсан өдрийг гаргана уу.
8)Хүргэлтийн машин, хүргэлтийн ажилчны хүснэгтээс хүргэлтийн машины дугаар, машины төрөл, хүргэлтийн ажилчны овог нэрийг харуулна уу./+хүргэлтийн ажилтны дугаар/
9)Захиалгын хүснэгтээс 2021 оны 11 сарын 1-нээс хойш захиалга өгсөн хэрэглэгчийн мэдээллийг харуулна уу.
10)Хан-Уул-ын салбар дахь ажилтнуудын бүх мэдээллийг харуулна уу.
8. SQL DML 10 асуулт
1)Turo төрлийн хүргэлтийн машины мэдээллийг гаргана уу.
2)Steak захиалсан хэрэглэгчийн мэдээллийг гаргана уу.
3)Хоолны хүснэгтээс Teriyaki_Chicken-ий мэдээллийг устгана уу.
4)Хоолны хүснэгт рүү Special_Menu нэртэй 3 хүний порцтой, 25000 үнэтэй хоолыг нэмнэ үү.
5)Хоолны хүснэгтийн Bulgogi нэртэй хоолны үнийг 13 хувиар нэмэгдүүлнэ үү.
6)Хан-Уул салбарт ажилладаг ажилчдын мэдээллийг салбарын нэр байршилтай нь гаргана уу.
7)UIH01 дугаартай машины хүргэлт хийсэн хоолны нэрийг гаргана уу.
Эсвэл

7. RA 10 асуулт
1)Хоолны мэдээллийн хүснэгтээс 20000-аас дээш үнэтэй хоолны мэдээллийг гаргана уу./Selection үйлдэл ашиглах/
2)Хоолны мэдээллийн хүснэгтээс хоолны нэр, порц, үнийн мэдээллийг харуулна уу.
3)Ажилчин, хүргэлтийн ажилчин хүснэгтүүдээс хүмүүсийн нэрсийн жагсаалтыг гаргана уу.
4)Захиалагдаагүй хоолны дугаарыг гаргана уу./FoodName price - Orderlist price/
5)Teriyaki_chicken захиалсан үйлчлүүлэгчийн утасны дугаар, гэрийн хаягийг харуулна уу.
6)Хоолны үнэ нь ажилтны цалингаас бага байх хоолны нэр, үнийн мэдээллийг харуулна уу.
7)Хоол ба захиалгын хүснэгтийг холбоод хоолны нэр, захиалсан өдрийг гаргана уу.
8)Хүргэлтийн машин, хүргэлтийн ажилчны хүснэгтээс хүргэлтийн машины дугаар, машины төрөл, хүргэлтийн ажилчны овог нэрийг харуулна уу./+хүргэлтийн ажилтны дугаар/
9)Захиалгын хүснэгтээс 2021 оны 11 сарын 1-нээс хойш захиалга өгсөн хэрэглэгчийн мэдээллийг харуулна уу.
10)Хан-Уул-ын салбар дахь ажилтнуудын бүх мэдээллийг харуулна уу.
8. 
1) 6.Системийн нэр: Хоол хүргэлтийн систем
Системийн талаар: Хоол хүргэлтийн үйл ажиллагааг автоматжуулах систем
7. RA 10 асуулт
1)Хоолны мэдээллийн хүснэгтээс 20000-аас дээш үнэтэй хоолны мэдээллийг гаргана уу./Selection үйлдэл ашиглах/
2)Хоолны мэдээллийн хүснэгтээс хоолны нэр, порц, үнийн мэдээллийг харуулна уу.
3)Ажилчин, хүргэлтийн ажилчин хүснэгтүүдээс хүмүүсийн нэрсийн жагсаалтыг гаргана уу.
4)Захиалагдаагүй хоолны дугаарыг гаргана уу./FoodName price - Orderlist price/
5)Teriyaki_chicken захиалсан үйлчлүүлэгчийн утасны дугаар, гэрийн хаягийг харуулна уу.
6)Хоолны үнэ нь ажилтны цалингаас бага байх хоолны нэр, үнийн мэдээллийг харуулна уу.
7)Хоол ба захиалгын хүснэгтийг холбоод хоолны нэр, захиалсан өдрийг гаргана уу.
8)Хүргэлтийн машин, хүргэлтийн ажилчны хүснэгтээс хүргэлтийн машины дугаар, машины төрөл, хүргэлтийн ажилчны овог нэрийг харуулна уу./+хүргэлтийн ажилтны дугаар/
9)Захиалгын хүснэгтээс 2021 оны 11 сарын 1-нээс хойш захиалга өгсөн хэрэглэгчийн мэдээллийг харуулна уу.
10)Хан-Уул-ын салбар дахь ажилтнуудын бүх мэдээллийг харуулна уу.
8. 
1)Turo төрлийн хүргэлтийн машины мэдээллийг гаргана уу.
2)Steak захиалсан хэрэглэгчийн мэдээллийг гаргана уу.
3)Хоолны хүснэгтээс Teryaki_Chicken-ий мэдээллийг устгана уу.
4)Хоолны хүснэгт рүү Special_Menu нэртэй 3 хүний порцтой, 25000 үнэтэй хоолыг нэмнэ үү.
5)Bulgogi нэртэй хоолны үнийг 13 хувиар нэмэгдүүлнэ үү.
6)Хан-Уул салбарт ажилладаг ажилчдын мэдээллийг салбарын нэр байршилтай нь гаргана уу.
7)UIH01 дугаартай хүргэлтийн машины хүргэлт хийсэн хоолны нэрийг гаргана уу.
Эсвэл 
UIH01 хүргэлтийн машины дугаартай ажилчны дугаартай ажилчны аль ээлжинд гардаг, аль салбарт ажилладагыг гаргана уу.
8)Хүмүүсийн хамгийн их үахиалсан хоолны мэдээллийг гаргана уж.
9)Салбар тус бүр дээр хэдэн ажилчинтай болон хамгийн хямд үнэтэй, хамгийн үнэтэй хоол, дундаж үнийн мэдээллийг гаргана уу.
10)C01 дугаартай үйлчлүүлэгчийн захиалсан хоолны үннэс их үнэтэй хоолны мэдээллийг гаргана уу.
